src_doc/InformationRegisters/ВерсииСогласованныхФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВерсииСогласованныхФайлов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВизаСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВизыСогласования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/Catalogs/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Файлы</Name>
			<Comment>Файлы в папках</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор - пользователь, добавивший файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Comment>Владелец файла</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецФайлов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаема</Name>
					<Comment>Дата заема на редактирование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата добавления файла в базу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зашифрован</Name>
					<Comment>Файл зашифрован</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Comment>Индекс иконки, соответствующей расширению файла, для показа в списке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУдалятьСтарыеВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Comment>Файл подписан ЭП</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Comment>Полное наименование (длиной до 256 символов)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактирует</Name>
					<Comment>Пользователь, занявший файл для редактирования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтратегияРаспознавания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтратегииРаспознаванияТекста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсия</Name>
					<Comment>Активная версия</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияАвтор</Name>
					<Comment>Автор - пользователь, создавший версию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияДатаМодификацииФайла</Name>
					<Comment>Дата модификации файла - в локальном времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияДатаСоздания</Name>
					<Comment>Дата создания версии</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияКод</Name>
					<Comment>Текущая версия код</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияНомерВерсии</Name>
					<Comment>Номер версии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияПутьКФайлу</Name>
					<Comment>Дополнительный путь к файлу на диске (в случае если тип хранения файла - на диске)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияРазмер</Name>
					<Comment>Размер файла версии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияРасширение</Name>
					<Comment>Расширение файла версии</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияТом</Name>
					<Comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТомаХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТекстХранилище</Name>
					<Comment>Текст, извлеченный из файла - для полнотекстового поиска   в 3.0.10 переименовано</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьВерсии</Name>
					<Comment>Хранить версии - если Ложь, у файла всегда одна версия - активная</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОснованиеДляСоздания</Name>
					<Comment>Шаблон файла, на основании которого был создан данный файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯзыкРаспознавания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СубъектыПерсональныхДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_doc/InformationRegisters/ВерсииСогласованныхФайлов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет версии файлов документа в регистр.
// Фиксирует все версии файлов, на момент установки результат для визы.
//
// Параметры:
//  ВизаСогласования - СправочникСсылка.ВизыСогласования - ссылка на визу.
//  Документ - СправочникСсылка.ДокументыПредприятия - ссылка на документ.
//
Процедура ДобавитьВерсииФайловПоВизе(ВизаСогласования, Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Файлы.Ссылка КАК Файл,
		|	Файлы.ТекущаяВерсия КАК ВерсияФайла
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СлужебныеФайлыДокументов КАК СлужебныеФайлыДокументов
		|		ПО Файлы.Ссылка = СлужебныеФайлыДокументов.Файл
		|ГДЕ
		|	Файлы.ВладелецФайла = &Документ
		|	И СлужебныеФайлыДокументов.Файл ЕСТЬ NULL
		|	И Не Файлы.ПометкаУдаления";
		
	Запрос.Параметры.Вставить("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.ВизаСогласования = ВизаСогласования;
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Удаляет версии согласованных файлов из регистра.
// Удаляет сохраненные версии файлов, на момент снятия результата согласования визы.
//
// Параметры:
//  ВизаСогласования - СправочникСсылка.ВизыСогласования - ссылка на визу.
//
Процедура УдалитьВерсииФайловПоВизе(ВизаСогласования) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВизаСогласования.Установить(ВизаСогласования);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Возвращает все версии согласованных файлов по списку виз согласования.
// 
// Параметры:
//  Документ - СправочникССылка.ДокументыПредприятия
//  ВизыСогласования - Массив - Визы согласования в этом документе
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Все версии по списку виз
//
Функция ВсеВерсииПоСпискуВиз(Документ, ВизыСогласования) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВизыСогласования.Документ КАК ДокументПредприятия,
		|	ВизыСогласования.Ссылка КАК Виза,
		|	ВизыСогласования.ДатаИсполнения КАК ДатаИсполнения
		|ПОМЕСТИТЬ ДокументыПоВизе
		|ИЗ
		|	Справочник.ВизыСогласования КАК ВизыСогласования
		|ГДЕ
		|	ВизыСогласования.Ссылка В(&ВизыСогласования)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументПредприятия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Файлы.Ссылка КАК Ссылка,
		|	Файлы.ТекущаяВерсияРасширение КАК Расширение,
		|	Файлы.ВладелецФайла КАК ВладелецФайла,
		|	Файлы.ТекущаяВерсия КАК ТекущаяВерсия,
		|	Файлы.ДатаСоздания КАК ДатаСоздания
		|ПОМЕСТИТЬ ФайлыДокумента
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СлужебныеФайлыДокументов КАК СлужебныеФайлыДокументов
		|		ПО (СлужебныеФайлыДокументов.Файл = Файлы.Ссылка)
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайла
		|	И Файлы.ПометкаУдаления = ЛОЖЬ
		|	И СлужебныеФайлыДокументов.Файл ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	ВладелецФайла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВерсииСогласованныхФайлов.ВерсияФайла КАК ВерсияФайла,
		|	ВерсииСогласованныхФайлов.Файл КАК Файл,
		|	ВерсииСогласованныхФайлов.ВизаСогласования КАК ВизаСогласования
		|ПОМЕСТИТЬ ВерсииСогласованныхФайловВизы
		|ИЗ
		|	РегистрСведений.ВерсииСогласованныхФайлов КАК ВерсииСогласованныхФайлов
		|ГДЕ
		|	ВерсииСогласованныхФайлов.ВизаСогласования В(&ВизыСогласования)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Файл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВерсииСогласованныхФайлов.ВерсияФайла КАК ВерсияФайла,
		|	ВерсииСогласованныхФайлов.Файл КАК Файл,
		|	ВерсииСогласованныхФайлов.ВизаСогласования КАК ВизаСогласования,
		|	ВЫБОР
		|		КОГДА Файлы.ТекущаяВерсия <> ВерсииСогласованныхФайлов.ВерсияФайла
		|				ИЛИ Файлы.ПометкаУдаления
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВерсияФайлаОтличается,
		|	Файлы.ТекущаяВерсия КАК ТекущаяВерсияФайла,
		|	Файлы.ТекущаяВерсия.НеМеняетСути КАК ВерсияНеМеняетСути,
		|	ВерсииСогласованныхФайлов.ВерсияФайла.Расширение КАК Расширение,
		|	ЛОЖЬ КАК ЭтоСканКопия,
		|	ИСТИНА КАК ОтслеживаниеВерсийПроизводилось
		|ИЗ
		|	ВерсииСогласованныхФайловВизы КАК ВерсииСогласованныхФайлов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО (Файлы.Ссылка = ВерсииСогласованныхФайлов.Файл)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Файлы.ТекущаяВерсия,
		|	Файлы.Ссылка,
		|	ДокументыПоВизе.Виза,
		|	ИСТИНА,
		|	Файлы.ТекущаяВерсия,
		|	ЛОЖЬ,
		|	Файлы.ТекущаяВерсия.Расширение,
		|	ЛОЖЬ,
		|	ДокументыПоВизе.ДатаИсполнения < Файлы.ДатаСоздания
		|ИЗ
		|	ФайлыДокумента КАК Файлы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыПоВизе КАК ДокументыПоВизе
		|		ПО (ДокументыПоВизе.ДокументПредприятия = Файлы.ВладелецФайла)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВерсииСогласованныхФайловВизы КАК ВерсииСогласованныхФайловВизы
		|		ПО Файлы.Ссылка = ВерсииСогласованныхФайловВизы.Файл
		|			И (ВерсииСогласованныхФайловВизы.ВизаСогласования = ДокументыПоВизе.Виза)
		|ГДЕ
		|	ВерсииСогласованныхФайловВизы.Файл ЕСТЬ NULL";
		
	Запрос.Параметры.Вставить("ВизыСогласования", ВизыСогласования); 
	Запрос.Параметры.Вставить("ВладелецФайла", Документ); 
	
	ВсеВерсии = Запрос.Выполнить().Выгрузить();
	УчетСканКопийОригиналов = ПолучитьФункциональнуюОпцию("ВестиУчетСканКопийОригиналовДокументов"); 
	Для Каждого СтрВерсия Из ВсеВерсии Цикл
		
		Если УчетСканКопийОригиналов 
			И ДелопроизводствоПовтИсп.ФайлЯвляетсяОригиналом(СтрВерсия.Файл) Тогда
			СтрВерсия.ЭтоСканКопия = Истина;
		КонецЕсли;
		
		Если Не СтрВерсия.ВерсияФайлаОтличается Или Не СтрВерсия.ВерсияНеМеняетСути Тогда
			Продолжить;
		КонецЕсли;
		
		// Требуется проверить, не являются ли данные версии Служебными.
		// Если версия НеМеняетСути, то проверяем ее Родителя. 
		// Если Родитель равен согласованной версии, значит отличий нет.
		ТекущаяВерсияФайла = СтрВерсия.ТекущаяВерсияФайла;
		Пока ЗначениеЗаполнено(ТекущаяВерсияФайла) Цикл
			РеквизитыВерсии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяВерсияФайла, 
				"РодительскаяВерсия, РодительскаяВерсия.НеМеняетСути");
			
			Если ЗначениеЗаполнено(РеквизитыВерсии.РодительскаяВерсия) 
				И РеквизитыВерсии.РодительскаяВерсия = СтрВерсия.ВерсияФайла Тогда
				СтрВерсия.ВерсияФайлаОтличается = Ложь;
				Прервать;
			КонецЕсли;
			
			Если РеквизитыВерсии.РодительскаяВерсияНеМеняетСути = Ложь Тогда
				Прервать;
			КонецЕсли;
			
			ТекущаяВерсияФайла = РеквизитыВерсии.РодительскаяВерсия;	
		КонецЦикла;
	КонецЦикла;
	
	Возврат ВсеВерсии;
	
КонецФункции

#КонецОбласти

#КонецЕсли
